app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Lorem ipsum"], ["created_at", Mon, 10 Dec 2012 18:52:14 UTC +00:00], ["updated_at", Mon, 10 Dec 2012 18:52:14 UTC +00:00], ["user_id", 20]]
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save