app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "49"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$XmGHRfjlY.jSOHyW4BPHbOrE5Sys.ODPlcfBV1VGTIx.07beEKVeG', "remember_token" = '3JvoDDN3uZiBwRHGXjXZCA', "updated_at" = '2012-12-07 11:50:43.160000' WHERE "users"."id" = 71